# Taps
tap "homebrew/cask-fonts"

# Shell utilities
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "htop"
brew "rcm"
brew "ripgrep"
brew "rsync"
brew "tree"
brew "wget"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "starship"

# Developer tools
brew "alacritty"
brew "cmake"
brew "git"
brew "git-delta"
brew "gpg"
brew "llvm"
brew "neovim"
brew "pinentry-mac"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tmux"

# Font
cask "font-fira-mono-nerd-font"
