# Shell utilities
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "htop"
brew "rcm"
brew "ripgrep"
brew "starship"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Developer tools
cask "alacritty"
brew "git"
brew "git-delta"
brew "gpg"
brew "neovim"
brew "node"
brew "pinentry-mac"
brew "pre-commit"
brew "tmux"
brew "uv"

# Font
cask "font-fira-code-nerd-font"
